# Analytical Power Distributable Node Data Properties

Source: https://www.revitapidocs.com/2026/3c54ac93-e8ca-b471-505e-4098cc04c620.htm

---

| Analytical Power Distributable Node Data Properties |
| --- |

The AnalyticalPowerDistributableNodeData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | AssignedPhasesNumber | The number of electrical phases assigned through the distribution system of the power distributable node. |
|  | AssignedVoltage | The voltage assigned through the distribution system of the power distributable node. |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | DistributionSystem | The distribution system of the power distributable node. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AnalyticalDistributionNodePropertyData ) |

Top See Also

#### Reference

AnalyticalPowerDistributableNodeData Class Autodesk.Revit.DB.Electrical Namespace